--------------------------------------------------------------

# ETL - Segunda parte

-------------------------------------------------

In [61]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

---------------------------------

### **SECCION 1:** creacion de un Dataframe para el KPI 1

-----------------------

**PASO 1:** Se vuelcan los datos a dataframes

In [121]:
df_1_ETL2 = pd.read_csv('Data\homicidios_2.csv')

In [122]:
df_gcba = pd.read_excel('Data\gcba_pob_comunas_17.xlsx')

Se comprueba dimensiones y nulos, aunque ya este limpio, por precaucion

In [123]:
print(len(df_1_ETL2))
print(df_1_ETL2.isnull().sum())
print(df_1_ETL2.columns)

df_1_ETL2.head(10)

696
Unnamed: 0               0
ID                       0
N_VICTIMAS               0
FECHA                    0
AAAA                     0
MM                       0
DD                       0
HORA                     0
HH                       0
LUGAR_DEL_HECHO          0
TIPO_DE_CALLE            0
Calle                    0
Cruce                    0
Dirección Normalizada    0
COMUNA                   0
PARTICIPANTES            0
VICTIMA                  0
ACUSADO                  0
dtype: int64
Index(['Unnamed: 0', 'ID', 'N_VICTIMAS', 'FECHA', 'AAAA', 'MM', 'DD', 'HORA',
       'HH', 'LUGAR_DEL_HECHO', 'TIPO_DE_CALLE', 'Calle', 'Cruce',
       'Dirección Normalizada', 'COMUNA', 'PARTICIPANTES', 'VICTIMA',
       'ACUSADO'],
      dtype='object')

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
1,1,2016-0002,1,2016-01-02,2016,1,2,01:15:00,1,AV GRAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,AUTO-PASAJEROS,AUTO,PASAJEROS
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS
5,5,2016-0008,1,2016-01-24,2016,1,24,18:30:00,18,AV 27 DE FEBRERO Y AV ESCALADA,AVENIDA,27 DE FEBRERO AV.,ESCALADA AV.,27 DE FEBRERO AV. y ESCALADA AV.,8,MOTO-OBJETO FIJO,MOTO,OBJETO FIJO
6,6,2016-0009,1,2016-01-24,2016,1,24,19:10:00,19,NOGOYA Y JOAQUIN V. GONZALES,CALLE,NOGOYA,"GONZALEZ, JOAQUIN V.","NOGOYA y GONZALEZ, JOAQUIN V.",11,MOTO-AUTO,MOTO,AUTO
7,7,2016-0010,1,2016-01-29,2016,1,29,15:20:00,15,AV GENERAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,MOTO-AUTO,MOTO,AUTO
8,8,2016-0012,1,2016-02-08,2016,2,8,01:20:00,1,AV BELGRANO Y BERNARDO DE IRIGOYEN,AVENIDA,BELGRANO AV.,"IRIGOYEN, BERNARDO DE","BELGRANO AV. e IRIGOYEN, BERNARDO DE",1,MOTO-CARGAS,MOTO,CARGAS
9,9,2016-0013,1,2016-02-10,2016,2,10,11:30:00,11,AV ENTRE RIOS 1366,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 1366,1,PEATON-AUTO,PEATON,AUTO

In [124]:
# Copia estandar

df_1_ETL2_v2 = df_1_ETL2.copy()

**PASO 2:** Se agrupa **"N_VICTIMAS"** por año y mes

In [125]:
df_1_ETL2_v3 = df_1_ETL2_v2.groupby(['AAAA', 'MM'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO:** Se comprueba

In [126]:
print(len(df_1_ETL2_v3))
print(df_1_ETL2_v3.isnull().sum())
print(df_1_ETL2_v3.columns)

df_1_ETL2_v3.head(10)

72
AAAA          0
MM            0
N_VICTIMAS    0
dtype: int64
Index(['AAAA', 'MM', 'N_VICTIMAS'], dtype='object')

   AAAA  MM  N_VICTIMAS
0  2016   1           8
1  2016   2          12
2  2016   3          13
3  2016   4          11
4  2016   5           7
5  2016   6          14
6  2016   7          11
7  2016   8          13
8  2016   9          12
9  2016  10          12

**PASO 3:** se selecciona y guarda en 2 nuevos Dataframes, los datos con los meses del 1 al 6 para el primer semestre, y del mes 7 al 12 para el segundo

In [127]:
df_1_ETL2_v3_Sem1 = df_1_ETL2_v3[(df_1_ETL2_v3['MM'] >= 1) & (df_1_ETL2_v3['MM'] <= 6)]

df_1_ETL2_v3_Sem2 = df_1_ETL2_v3[(df_1_ETL2_v3['MM'] >= 7) & (df_1_ETL2_v3['MM'] <= 12)]

DF con datos primer semestre

In [128]:
df_1_ETL2_v3_Sem1.head(6)

   AAAA  MM  N_VICTIMAS
0  2016   1           8
1  2016   2          12
2  2016   3          13
3  2016   4          11
4  2016   5           7
5  2016   6          14

DF con datos segundo semestre

In [129]:
df_1_ETL2_v3_Sem2.head(6)

    AAAA  MM  N_VICTIMAS
6   2016   7          11
7   2016   8          13
8   2016   9          12
9   2016  10          12
10  2016  11          14
11  2016  12          19

**PASO 4:** se suman los valores de **"N_VICTIMAS"** por **"AAAA"**, para que queden los valores totales de victimas por año

In [130]:
df_1_ETL2_v3_Sem1 = df_1_ETL2_v3_Sem1.groupby(['AAAA'])['N_VICTIMAS'].sum().reset_index()

Se renombran las columnas por comodidad y mejor entendimiento

In [131]:
df_1_ETL2_v3_Sem1 = df_1_ETL2_v3_Sem1.rename(columns={"N_VICTIMAS": "Numero de victimas en el primer semestre", "AAAA": "AÑO"})

**RESULTADO:**

In [132]:
df_1_ETL2_v3_Sem1

    AÑO  Numero de victimas en el primer semestre
0  2016                                        65
1  2017                                        69
2  2018                                        70
3  2019                                        57
4  2020                                        31
5  2021                                        55

Aqui se repite el mismo proceso de suma, que en el paso anterior

In [133]:
df_1_ETL2_v3_Sem2 = df_1_ETL2_v3_Sem2.groupby(['AAAA'])['N_VICTIMAS'].sum().reset_index()

Se renombran las columnas

In [134]:
df_1_ETL2_v3_Sem2 = df_1_ETL2_v3_Sem2.rename(columns={"N_VICTIMAS": "Numero de victimas en el segundo semestre", "AAAA": "AÑO"})

**RESULTADO:**

In [135]:
df_1_ETL2_v3_Sem2

    AÑO  Numero de victimas en el segundo semestre
0  2016                                         81
1  2017                                         71
2  2018                                         79
3  2019                                         47
4  2020                                         50
5  2021                                         42

**PASO 5:** se hace el merge de ambos Dataframes, que luego seran cargados en archivo excel como una pestaña

In [136]:
df_1_ETL2_v4 = pd.merge(df_1_ETL2_v3_Sem1, df_1_ETL2_v3_Sem2, on='AÑO')

**RESULTADO:**

In [137]:
df_1_ETL2_v4

,AÑO,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre
0,2016,65,81
1,2017,69,71
2,2018,70,79
3,2019,57,47
4,2020,31,50
5,2021,55,42

**PASO 6:** Se carga el segundo Dataframe con la poblacion por comuna de Ciudad Autonoma de Buenos Aires, pero en este caso estamos creando una Dataframe con las victimas <br> 
totales de CABA por lo tanto se necesita hacer una suma de toda la poblacion, para luego concretar las operaciones, este archivo con la poblacion corresponde al ultimo censo <br> 
realizado en el año 2017, ya que es la unica fuente de informacion disponible en la pagina de informaciones del gobierno de la Ciudad Autonoma de Buenos Aires

In [138]:
df_gcba

    COMUNA  POBLACION
0        1     253271
1        2     149720
2        3     192763
3        4     238809
4        5     186956
5        6     184846
6        7     240607
7        8     226649
8        9     170605
9       10     170282
10      11     189986
11      12     213914
12      13     235967
13      14     226944
14      15     182409

Se hace una copia por seguridad y se hace la suma total de toda la poblacion de CABA

In [139]:
df_gcba_v2 = df_gcba.copy()

df_gcba_v3 = df_gcba_v2['POBLACION'].sum()

**RESULTADO:**

In [140]:
df_gcba_v3

3063728

In [141]:
# Copia estandar

df_1_ETL2_v5 = df_1_ETL2_v4.copy()

**PASO 7:** se agrega la columna **"Poblacion total"** del DF anterior a el dataframe principal

In [142]:
df_1_ETL2_v5["Poblacion total de CABA"] = df_gcba_v3

**RESULTADO:**

In [143]:
df_1_ETL2_v5

,AÑO,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre,Poblacion total de CABA
0,2016,65,81,3063728
1,2017,69,71,3063728
2,2018,70,79,3063728
3,2019,57,47,3063728
4,2020,31,50,3063728
5,2021,55,42,3063728

**PASO 8:** se crean 3 nuevas columnas la columna **"Victimas x100K hab en el primer semestre"**, **"Victimas x100K hab en el segundo semestre"** y **"Victimas por Año"** auto explicativas.

In [145]:
df_1_ETL2_v5['Victimas x100K hab en el primer semestre'] = (((df_1_ETL2_v5['Numero de victimas en el primer semestre']) / (df_1_ETL2_v5['Poblacion total de CABA'])) * 100000).round(2)

df_1_ETL2_v5['Victimas x100K hab en el segundo semestre'] = (((df_1_ETL2_v5['Numero de victimas en el segundo semestre']) / (df_1_ETL2_v5['Poblacion total de CABA'])) * 100000).round(2)

df_1_ETL2_v5['Victimas por Año'] = ((df_1_ETL2_v5['Numero de victimas en el primer semestre']) + (df_1_ETL2_v5['Numero de victimas en el segundo semestre']))

In [146]:
df_1_ETL2_v5

,AÑO,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre,Poblacion total de CABA,Victimas x100K hab en el primer semestre,Victimas x100K hab en el segundo semestre,Victimas por Año
0,2016,65,81,3063728,2.12,2.64,146
1,2017,69,71,3063728,2.25,2.32,140
2,2018,70,79,3063728,2.28,2.58,149
3,2019,57,47,3063728,1.86,1.53,104
4,2020,31,50,3063728,1.01,1.63,81
5,2021,55,42,3063728,1.80,1.37,97

**"PASO 9:"** se crea la penultima columna **"Victimas x100K hab anuales"**

In [147]:
df_1_ETL2_v5['Victimas x100K hab anuales'] = ((df_1_ETL2_v5["Victimas por Año"]) / (df_1_ETL2_v5['Poblacion total de CABA']) * 100000).round(2)

**RESULTADO:**

In [148]:
df_1_ETL2_v5

,AÑO,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre,Poblacion total de CABA,Victimas x100K hab en el primer semestre,Victimas x100K hab en el segundo semestre,Victimas por Año,Victimas x100K hab anuales
0,2016,65,81,3063728,2.12,2.64,146,4.77
1,2017,69,71,3063728,2.25,2.32,140,4.57
2,2018,70,79,3063728,2.28,2.58,149,4.86
3,2019,57,47,3063728,1.86,1.53,104,3.39
4,2020,31,50,3063728,1.01,1.63,81,2.64
5,2021,55,42,3063728,1.80,1.37,97,3.17

In [149]:
# Copia estandar

df_1_ETL2_v6 = df_1_ETL2_v5.copy()

**PASO 10:** se crea la ultima columna con la variacion de victimas cada 100000 habitantes para el año anterior, obviamente al no tener datos anteriores al 2016 en este año la variacion es 0 <br> para esto se hace el calculo linea por linea y se guarda en una lista, la cual se transformar en la ultima columna del DF final

In [150]:
lista_calculo_1 = [] # Lista vacia donde se guardan los datos

for x in range(5): # Loop para iterar

    calculo = (((df_1_ETL2_v6.iloc[x]['Victimas x100K hab anuales'] - df_1_ETL2_v6.iloc[x + 1]['Victimas x100K hab anuales']) / (df_1_ETL2_v6.iloc[x]['Victimas x100K hab anuales'])) * 100).round(1)
    
    lista_calculo_1.append(calculo * -1) # se adicional los datos a la lista y se multiplican por -1 para cambiar de signo

Resultado de la lista

In [151]:
lista_calculo_1

[-4.2, 6.3, -30.2, -22.1, 20.1]

**PASO 11:** se crea la ultima columna con la lista creada anteriormente

In [152]:
for x in range(5):
    
    df_1_ETL2_v6.loc[x + 1, 'Variacion con el año anterior'] = lista_calculo_1[x]

**RESULTADO:**

In [153]:
df_1_ETL2_v6

,AÑO,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre,Poblacion total de CABA,Victimas x100K hab en el primer semestre,Victimas x100K hab en el segundo semestre,Victimas por Año,Victimas x100K hab anuales,Variacion con el año anterior
0,2016,65,81,3063728,2.12,2.64,146,4.77,NaN
1,2017,69,71,3063728,2.25,2.32,140,4.57,-4.2
2,2018,70,79,3063728,2.28,2.58,149,4.86,6.3
3,2019,57,47,3063728,1.86,1.53,104,3.39,-30.2
4,2020,31,50,3063728,1.01,1.63,81,2.64,-22.1
5,2021,55,42,3063728,1.80,1.37,97,3.17,20.1

**"PASO 12:"** se normaliza la columna **"Variacion con el año anterior"** ya que se puede ver en el resultado que el año 2016 no tiene antecedentes anteriores y se adiciono los valores <br> 
 de la lista a partir de la segunda fila, por eso se genero un valor nulo en la primera fila, aqui se reemplaza el valor nulo con el numero 0 y se normaliza los datos a strings con formato **"XX,X %"**.

In [154]:
# Se reemplaza el valor nulo

df_1_ETL2_v6["Variacion con el año anterior"].replace(to_replace=np.nan, value=0, inplace=True)

In [155]:
# Se normaliza la columna a strings formato "xx,x %"

df_1_ETL2_v6["Variacion con el año anterior"] = (df_1_ETL2_v6["Variacion con el año anterior"].astype(str) + " %")

**RESULTADO:**

In [219]:
df_1_ETL2_v6.head(6)

,AÑO,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre,Poblacion total de CABA,Victimas x100K hab en el primer semestre,Victimas x100K hab en el segundo semestre,Victimas por Año,Victimas x100K hab anuales,Variacion con el año anterior
0,2016,65,81,3063728,2.12,2.64,146,4.77,0.0 %
1,2017,69,71,3063728,2.25,2.32,140,4.57,-4.2 %
2,2018,70,79,3063728,2.28,2.58,149,4.86,6.3 %
3,2019,57,47,3063728,1.86,1.53,104,3.39,-30.2 %
4,2020,31,50,3063728,1.01,1.63,81,2.64,-22.1 %
5,2021,55,42,3063728,1.80,1.37,97,3.17,20.1 %

El dataframe final **"df_1_ETL2_v6"** esta listo para ser cargado

-------------------------------------------------------------

### **SECCION 2:** se crean los DFs con los datos de victimas por comuna de CABA

-----------------------------

**PASO 1:** Se vuelcan los datos a dataframes

In [177]:
df_1_ETL2_2_v2 = df_1_ETL2.copy()

**PASO 2:** Se agrupa **"N_VICTIMAS"** por año y mes y comuna

In [178]:
df_1_ETL2_2_v2 = df_1_ETL2_2_v2.groupby(['AAAA','MM','COMUNA'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO:** se comprueba largo, columnas, nulos y una vista previa

In [179]:
print(len(df_1_ETL2_2_v2))
print(df_1_ETL2_2_v2.isnull().sum())
df_1_ETL2_2_v2.head()

481
AAAA          0
MM            0
COMUNA        0
N_VICTIMAS    0
dtype: int64

   AAAA  MM  COMUNA  N_VICTIMAS
0  2016   1       1           2
1  2016   1       8           3
2  2016   1       9           2
3  2016   1      11           1
4  2016   2       1           4

In [180]:
# Copia estandar

df_1_ETL2_2_v3 = df_1_ETL2_2_v2.copy()

**PASO 3:** se selecciona y guarda en 2 nuevos Dataframes, los datos con los meses del 1 al 6 para el primer semestre, y del mes 7 al 12 para el segundo, esta vez con los datos por **"COMUNA"**

In [181]:
df_1_ETL2_2_v3_Sem1 = df_1_ETL2_2_v3[(df_1_ETL2_2_v3['MM'] >= 1) & (df_1_ETL2_2_v3['MM'] <= 6)]

df_1_ETL2_2_v3_Sem2 = df_1_ETL2_2_v3[(df_1_ETL2_2_v3['MM'] >= 7) & (df_1_ETL2_2_v3['MM'] <= 12)]

**RESULTADO:** Datos primer semestre

In [182]:
print(len(df_1_ETL2_2_v3_Sem1))
print(df_1_ETL2_2_v3_Sem1.isnull().sum())
print(df_1_ETL2_2_v3_Sem1['MM'].value_counts())
df_1_ETL2_2_v3_Sem1.head()

242
AAAA          0
MM            0
COMUNA        0
N_VICTIMAS    0
dtype: int64
MM
1    50
5    42
6    41
2    39
3    36
4    34
Name: count, dtype: int64

   AAAA  MM  COMUNA  N_VICTIMAS
0  2016   1       1           2
1  2016   1       8           3
2  2016   1       9           2
3  2016   1      11           1
4  2016   2       1           4

**RESULTADO:** Datos segundo semestre

In [183]:
print(len(df_1_ETL2_2_v3_Sem2))
print(df_1_ETL2_2_v3_Sem2.isnull().sum())
print(df_1_ETL2_2_v3_Sem2['MM'].value_counts())
df_1_ETL2_2_v3_Sem2.head()

239
AAAA          0
MM            0
COMUNA        0
N_VICTIMAS    0
dtype: int64
MM
12    48
11    45
8     40
10    36
7     35
9     35
Name: count, dtype: int64

    AAAA  MM  COMUNA  N_VICTIMAS
40  2016   7       1           2
41  2016   7       3           1
42  2016   7       5           1
43  2016   7       6           1
44  2016   7       8           1

Se cambian los nombres de las columnas para mejor distincion y comodidad

In [184]:
df_1_ETL2_2_v3_Sem1 = df_1_ETL2_2_v3_Sem1.rename(columns={"N_VICTIMAS": "Numero de victimas en el primer semestre"})

df_1_ETL2_2_v3_Sem2 = df_1_ETL2_2_v3_Sem2.rename(columns={"N_VICTIMAS": "Numero de victimas en el segundo semestre"})

**PASO 4:** Se agrupan la cantidad de victimas por comuna y año

In [191]:
df_1_ETL2_2_v3_Sem1 = df_1_ETL2_2_v3_Sem1.groupby(['AAAA','COMUNA'])["Numero de victimas en el primer semestre"].sum().reset_index()

df_1_ETL2_2_v3_Sem2 = df_1_ETL2_2_v3_Sem2.groupby(['AAAA','COMUNA'])["Numero de victimas en el segundo semestre"].sum().reset_index()

**RESULTADO:** Datos DF primer semestre sin mes

In [193]:
print(len(df_1_ETL2_2_v3_Sem1))
print(df_1_ETL2_2_v3_Sem1.isnull().sum())
print(df_1_ETL2_2_v3_Sem1['AAAA'].value_counts())
df_1_ETL2_2_v3_Sem1.head()

86
AAAA                                        0
COMUNA                                      0
Numero de victimas en el primer semestre    0
dtype: int64
AAAA
2017    15
2018    15
2021    15
2016    14
2019    14
2020    13
Name: count, dtype: int64

   AAAA  COMUNA  Numero de victimas en el primer semestre
0  2016       1                                        12
1  2016       2                                         1
2  2016       3                                         4
3  2016       4                                         7
4  2016       6                                         2

**RESULTADO:** Datos DF segundo semestre sin mes

In [194]:
print(len(df_1_ETL2_2_v3_Sem2))
print(df_1_ETL2_2_v3_Sem2.isnull().sum())
print(df_1_ETL2_2_v3_Sem2['AAAA'].value_counts())
df_1_ETL2_2_v3_Sem2.head()

84
AAAA                                         0
COMUNA                                       0
Numero de victimas en el segundo semestre    0
dtype: int64
AAAA
2016    15
2017    15
2018    14
2020    14
2021    14
2019    12
Name: count, dtype: int64

   AAAA  COMUNA  Numero de victimas en el segundo semestre
0  2016       0                                          2
1  2016       1                                         10
2  2016       3                                          4
3  2016       4                                          9
4  2016       5                                          3

**PASO 5:** Se copia y carga el segundo Dataframe con la poblacion por comuna de Ciudad Autonoma de Buenos Aires.

In [195]:
df_gcba_2_v2 = df_gcba.copy()
df_gcba_2_v2

    COMUNA  POBLACION
0        1     253271
1        2     149720
2        3     192763
3        4     238809
4        5     186956
5        6     184846
6        7     240607
7        8     226649
8        9     170605
9       10     170282
10      11     189986
11      12     213914
12      13     235967
13      14     226944
14      15     182409

**PASO 5:** Se hace el merge solo con el DF del primer semestre ya que luego se va hace un merge con el del segundo semestre, se junta la columna **"COMUNA"** y la columna **"POBLACION"**

In [211]:
df_1_ETL2_2_v4_S1 = pd.merge(df_1_ETL2_2_v3_Sem1, df_gcba_2_v2, on='COMUNA')

**RESULTADO:** Datos DF primer semestre merged

In [212]:
print(len(df_1_ETL2_2_v4_S1))
print(df_1_ETL2_2_v4_S1.isnull().sum())
print(df_1_ETL2_2_v4_S1['COMUNA'].value_counts())
df_1_ETL2_2_v4_S1.head()

86
AAAA                                        0
COMUNA                                      0
Numero de victimas en el primer semestre    0
POBLACION                                   0
dtype: int64
COMUNA
1     6
2     6
3     6
4     6
6     6
7     6
8     6
9     6
11    6
13    6
14    6
15    6
10    5
5     5
12    4
Name: count, dtype: int64

   AAAA  COMUNA  Numero de victimas en el primer semestre  POBLACION
0  2016       1                                        12     253271
1  2017       1                                        13     253271
2  2018       1                                         9     253271
3  2019       1                                         9     253271
4  2020       1                                         5     253271

**PASO 6:** Se hace el merge del DF con los datos del priemer y segundo semestre

In [213]:
df_1_ETL2_2_v5 = pd.merge(df_1_ETL2_2_v4_S1, df_1_ETL2_2_v3_Sem2, on=['COMUNA','AAAA'])

**RESULTADO:** Datos DF merged, se ve que se perdieron datos ya que no todas las 15 comunas tienen datos anuales

In [214]:
print(len(df_1_ETL2_2_v5))
print(df_1_ETL2_2_v5.isnull().sum())
print(df_1_ETL2_2_v5['AAAA'].value_counts())
df_1_ETL2_2_v5.head()

79
AAAA                                         0
COMUNA                                       0
Numero de victimas en el primer semestre     0
POBLACION                                    0
Numero de victimas en el segundo semestre    0
dtype: int64
AAAA
2017    15
2018    14
2021    14
2016    13
2020    12
2019    11
Name: count, dtype: int64

,AAAA,COMUNA,Numero de victimas en el primer semestre,POBLACION,Numero de victimas en el segundo semestre
0,2016,1,12,253271,10
1,2017,1,13,253271,7
2,2018,1,9,253271,11
3,2019,1,9,253271,3
4,2020,1,5,253271,5

**PASO 7:** Se crean 3 nuevas columnas la columna **"Victimas x100K hab en el primer semestre"**, **"Victimas x100K hab en el segundo semestre"**, **"Victimas por Año"** <br> 
y **"Victimas x100K hab anuales"** auto explicativas.

In [215]:
df_1_ETL2_2_v5['Victimas x100K hab en el primer semestre'] = (((df_1_ETL2_2_v5['Numero de victimas en el primer semestre']) / (df_1_ETL2_2_v5['POBLACION'])) * 100000).round(2)

df_1_ETL2_2_v5['Victimas x100K hab en el segundo semestre'] = (((df_1_ETL2_2_v5['Numero de victimas en el segundo semestre']) / (df_1_ETL2_2_v5['POBLACION'])) * 100000).round(2)

df_1_ETL2_2_v5['Victimas por Año'] = ((df_1_ETL2_2_v5['Numero de victimas en el primer semestre']) + (df_1_ETL2_2_v5['Numero de victimas en el segundo semestre']))

In [220]:
df_1_ETL2_2_v5['Victimas x100K hab anuales'] = ((df_1_ETL2_2_v5["Victimas por Año"]) / (df_1_ETL2_2_v5['POBLACION']) * 100000).round(2)

**RESULTADO:** DF casi finalizado

In [221]:
print(len(df_1_ETL2_2_v5))
print(df_1_ETL2_2_v5.isnull().sum())
print(df_1_ETL2_2_v5['AAAA'].value_counts())
df_1_ETL2_2_v5.head()

79
AAAA                                         0
COMUNA                                       0
Numero de victimas en el primer semestre     0
POBLACION                                    0
Numero de victimas en el segundo semestre    0
Victimas x100K hab en el primer semestre     0
Victimas x100K hab en el segundo semestre    0
Victimas por Año                             0
Victimas x100K hab anuales                   0
dtype: int64
AAAA
2017    15
2018    14
2021    14
2016    13
2020    12
2019    11
Name: count, dtype: int64

,AAAA,COMUNA,Numero de victimas en el primer semestre,POBLACION,Numero de victimas en el segundo semestre,Victimas x100K hab en el primer semestre,Victimas x100K hab en el segundo semestre,Victimas por Año,Victimas x100K hab anuales
0,2016,1,12,253271,10,4.74,3.95,22,8.69
1,2017,1,13,253271,7,5.13,2.76,20,7.90
2,2018,1,9,253271,11,3.55,4.34,20,7.90
3,2019,1,9,253271,3,3.55,1.18,12,4.74
4,2020,1,5,253271,5,1.97,1.97,10,3.95

In [229]:
# Copia estandar

df_1_ETL2_2_v6 = df_1_ETL2_2_v5.copy()

**PASO 8:** Se elimina la columna **"POBLACION"** ya que cumplio su funcion al crear las columnas con calculos y se cambia el nombre de la columna **"AAAA"** a **AÑO** <BR> para facilitar la ligacion de las tablas en POWER BI

In [230]:
df_1_ETL2_2_v6 = df_1_ETL2_2_v6.drop(['POBLACION'], axis=1)

df_1_ETL2_2_v6 = df_1_ETL2_2_v6.rename(columns={"AAAA": "AÑO"})

**RESULTADO:** DF finalizado

In [232]:
print(len(df_1_ETL2_2_v6))
print(df_1_ETL2_2_v6.isnull().sum())
print(df_1_ETL2_2_v6['AÑO'].value_counts())
df_1_ETL2_2_v6.head()

79
AÑO                                          0
COMUNA                                       0
Numero de victimas en el primer semestre     0
Numero de victimas en el segundo semestre    0
Victimas x100K hab en el primer semestre     0
Victimas x100K hab en el segundo semestre    0
Victimas por Año                             0
Victimas x100K hab anuales                   0
dtype: int64
AÑO
2017    15
2018    14
2021    14
2016    13
2020    12
2019    11
Name: count, dtype: int64

,AÑO,COMUNA,Numero de victimas en el primer semestre,Numero de victimas en el segundo semestre,Victimas x100K hab en el primer semestre,Victimas x100K hab en el segundo semestre,Victimas por Año,Victimas x100K hab anuales
0,2016,1,12,10,4.74,3.95,22,8.69
1,2017,1,13,7,5.13,2.76,20,7.90
2,2018,1,9,11,3.55,4.34,20,7.90
3,2019,1,9,3,3.55,1.18,12,4.74
4,2020,1,5,5,1.97,1.97,10,3.95

El dataframe final **"df_1_ETL2_2_v6"** esta listo para ser cargado

---------------------------------------------------------------------

### **SECCION 3:** creacion de un Dataframe para el KPI 2

-------------------------------------------------

**PASO 1:** Se vuelcan los datos a dataframes

In [222]:
df_1_ETL2_3 = df_1_ETL2.copy()

Se revisa preliminarmente el DF

In [223]:
print(len(df_1_ETL2_3))
print(df_1_ETL2_3.isnull().sum())
df_1_ETL2_3.head()

696
Unnamed: 0               0
ID                       0
N_VICTIMAS               0
FECHA                    0
AAAA                     0
MM                       0
DD                       0
HORA                     0
HH                       0
LUGAR_DEL_HECHO          0
TIPO_DE_CALLE            0
Calle                    0
Cruce                    0
Dirección Normalizada    0
COMUNA                   0
PARTICIPANTES            0
VICTIMA                  0
ACUSADO                  0
dtype: int64

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
1,1,2016-0002,1,2016-01-02,2016,1,2,01:15:00,1,AV GRAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,AUTO-PASAJEROS,AUTO,PASAJEROS
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS

**PASO 2:** Se filtra las columnas en las cuales las victimas este en motocicleta.

In [224]:
df_1_ETL2_3_v2 = df_1_ETL2_3[df_1_ETL2_3["VICTIMA"] == "MOTO"]

**RESULTADO**

In [225]:
print(len(df_1_ETL2_3_v2))
print(df_1_ETL2_3_v2.isnull().sum())
df_1_ETL2_3_v2.head()

295
Unnamed: 0               0
ID                       0
N_VICTIMAS               0
FECHA                    0
AAAA                     0
MM                       0
DD                       0
HORA                     0
HH                       0
LUGAR_DEL_HECHO          0
TIPO_DE_CALLE            0
Calle                    0
Cruce                    0
Dirección Normalizada    0
COMUNA                   0
PARTICIPANTES            0
VICTIMA                  0
ACUSADO                  0
dtype: int64

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS
5,5,2016-0008,1,2016-01-24,2016,1,24,18:30:00,18,AV 27 DE FEBRERO Y AV ESCALADA,AVENIDA,27 DE FEBRERO AV.,ESCALADA AV.,27 DE FEBRERO AV. y ESCALADA AV.,8,MOTO-OBJETO FIJO,MOTO,OBJETO FIJO

**PASO 3:** Se agrupa el numero de victimas por año.

In [226]:
df_1_ETL2_3_v3 = df_1_ETL2_3_v2.groupby(['AAAA'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO:** El DF con numero de victimas por año

In [228]:
print(len(df_1_ETL2_3_v3))
print(df_1_ETL2_3_v3.isnull().sum())
df_1_ETL2_3_v3.head(6)

6
AAAA          0
N_VICTIMAS    0
dtype: int64

   AAAA  N_VICTIMAS
0  2016          65
1  2017          56
2  2018          57
3  2019          50
4  2020          28
5  2021          46

In [234]:
# Copia estandar

df_1_ETL2_3_v4 = df_1_ETL2_3_v3.copy()

**PASO 4:** Se hace el calculo de la variacion por año anterior, en una lista y se adiciona al DF

In [235]:
lista_calculo = []

for x in range(5):

    calculo = (((df_1_ETL2_3_v4.iloc[x]['N_VICTIMAS'] - df_1_ETL2_3_v4.iloc[x + 1]['N_VICTIMAS']) / (df_1_ETL2_3_v4.iloc[x]['N_VICTIMAS'])) * 100).round(2)
    
    lista_calculo.append(calculo * -1)

**RESULTADO:** Lista con valores de la variacion

In [236]:
lista_calculo

[-13.85, 1.79, -12.28, -44.0, 64.29]

In [240]:
# Copia estandar

df_1_ETL2_3_v5 = df_1_ETL2_3_v4.copy()

Se adiciona la lista al DF

In [241]:
for x in range(5):
    df_1_ETL2_3_v5.loc[x + 1, 'Variacion comparada al año anterior'] = lista_calculo[x]

**RESULTADO:** DF con valores de la variacion

In [243]:
print(len(df_1_ETL2_3_v5))
print(df_1_ETL2_3_v5.isnull().sum())
df_1_ETL2_3_v5.head(6)

6
AAAA                                   0
N_VICTIMAS                             0
Variacion comparada al año anterior    1
dtype: int64

   AAAA  N_VICTIMAS  Variacion comparada al año anterior
0  2016          65                                  NaN
1  2017          56                               -13.85
2  2018          57                                 1.79
3  2019          50                               -12.28
4  2020          28                               -44.00
5  2021          46                                64.29

**PASO 5:** Se normaliza la columna **"Variacion comparada al año anterior"** se reemplaza los nulos y se normaliza a strings formato "XX,X %" las filas

In [245]:
# Se reeplaza los valores nulos

df_1_ETL2_3_v5["Variacion comparada al año anterior"].replace(to_replace=np.nan, value=0, inplace=True)

In [246]:
# Se normaliza la columna a strings formato "xx,x %"

df_1_ETL2_3_v5["Variacion comparada al año anterior"] = (df_1_ETL2_3_v5["Variacion comparada al año anterior"].astype(str) + " %")

**RESULTADO:** DF final

In [247]:
print(len(df_1_ETL2_3_v5))
print(df_1_ETL2_3_v5.isnull().sum())
df_1_ETL2_3_v5.head(6)

6
AAAA                                   0
N_VICTIMAS                             0
Variacion comparada al año anterior    0
dtype: int64

   AAAA  N_VICTIMAS Variacion comparada al año anterior
0  2016          65                               0.0 %
1  2017          56                            -13.85 %
2  2018          57                              1.79 %
3  2019          50                            -12.28 %
4  2020          28                             -44.0 %
5  2021          46                             64.29 %

El dataframe final **"df_1_ETL2_3_v5"** esta listo para ser cargado

----------------------------------------------------------

### **SECCION 4:** creacion de un Dataframe para las mediciones de tipo de victima

----------------------------------------------------------

Se confirma el DF base

In [248]:
print(len(df_1_ETL2))
print(df_1_ETL2.isnull().sum())
df_1_ETL2.head(6)

696
Unnamed: 0               0
ID                       0
N_VICTIMAS               0
FECHA                    0
AAAA                     0
MM                       0
DD                       0
HORA                     0
HH                       0
LUGAR_DEL_HECHO          0
TIPO_DE_CALLE            0
Calle                    0
Cruce                    0
Dirección Normalizada    0
COMUNA                   0
PARTICIPANTES            0
VICTIMA                  0
ACUSADO                  0
dtype: int64

,Unnamed: 0,ID,N_VICTIMAS,FECHA,AAAA,MM,DD,HORA,HH,LUGAR_DEL_HECHO,TIPO_DE_CALLE,Calle,Cruce,Dirección Normalizada,COMUNA,PARTICIPANTES,VICTIMA,ACUSADO
0,0,2016-0001,1,2016-01-01,2016,1,1,04:00:00,4,AV PIEDRA BUENA Y AV FERNANDEZ DE LA CRUZ,AVENIDA,PIEDRA BUENA AV.,"FERNANDEZ DE LA CRUZ, F., GRAL. AV.","PIEDRA BUENA AV. y FERNANDEZ DE LA CRUZ, F., G...",8,MOTO-AUTO,MOTO,AUTO
1,1,2016-0002,1,2016-01-02,2016,1,2,01:15:00,1,AV GRAL PAZ Y AV DE LOS CORRALES,GRAL PAZ,"PAZ, GRAL. AV.",DE LOS CORRALES AV.,"PAZ, GRAL. AV. y DE LOS CORRALES AV.",9,AUTO-PASAJEROS,AUTO,PASAJEROS
2,2,2016-0003,1,2016-01-03,2016,1,3,07:00:00,7,AV ENTRE RIOS 2034,AVENIDA,ENTRE RIOS AV.,Sin Cruce,ENTRE RIOS AV. 2034,1,MOTO-AUTO,MOTO,AUTO
3,3,2016-0004,1,2016-01-10,2016,1,10,00:00:00,0,AV LARRAZABAL Y GRAL VILLEGAS CONRADO,AVENIDA,LARRAZABAL AV.,"VILLEGAS, CONRADO, GRAL.","LARRAZABAL AV. y VILLEGAS, CONRADO, GRAL.",8,MOTO-SD,MOTO,SD
4,4,2016-0005,1,2016-01-21,2016,1,21,05:20:00,5,AV SAN JUAN Y PRESIDENTE LUIS SAENZ PEÑA,AVENIDA,SAN JUAN AV.,"SAENZ PE?A, LUIS, PRES.","SAN JUAN AV. y SAENZ PEÃ‘A, LUIS, PRES.",1,MOTO-PASAJEROS,MOTO,PASAJEROS
5,5,2016-0008,1,2016-01-24,2016,1,24,18:30:00,18,AV 27 DE FEBRERO Y AV ESCALADA,AVENIDA,27 DE FEBRERO AV.,ESCALADA AV.,27 DE FEBRERO AV. y ESCALADA AV.,8,MOTO-OBJETO FIJO,MOTO,OBJETO FIJO

In [299]:
# Copia estandar

df_1_ETL2_4_v1 = df_1_ETL2.copy()

**PASO 1:** Se agrupa el DF por año y la columna **"VICTIMA"** que muestra el tipo de vehiculo (o peaton) en el cual circulaba el victima.

In [300]:
df_1_ETL2_4_v1 = df_1_ETL2_4_v1.groupby(['AAAA', 'VICTIMA'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [301]:
print(len(df_1_ETL2_4_v1))
print(df_1_ETL2_4_v1.isnull().sum())
df_1_ETL2_4_v1.head(6)

37
AAAA          0
VICTIMA       0
N_VICTIMAS    0
dtype: int64

   AAAA    VICTIMA  N_VICTIMAS
0  2016       AUTO          18
1  2016  BICICLETA           4
2  2016     CARGAS           3
3  2016       MOTO          65
4  2016      MOVIL           1
5  2016  PASAJEROS           1

**PASO 2:** Se ordena por año y n de victimas, y despues se toman los 5 mayores por año.

In [305]:
# Se ordena en orden descendiente

df_1_ETL2_4_v1 = df_1_ETL2_4_v1.sort_values(["AAAA","N_VICTIMAS"], ascending=False)

In [310]:
# Se toman los 5 primeros de cada año

df_1_ETL2_4_v1 = df_1_ETL2_4_v1.groupby('AAAA').head(5)

**RESULTADO:** Casi final

In [313]:
print(len(df_1_ETL2_4_v1))
print(df_1_ETL2_4_v1.isnull().sum())
df_1_ETL2_4_v1.head()

30
AAAA          0
VICTIMA       0
N_VICTIMAS    0
dtype: int64

    AAAA    VICTIMA  N_VICTIMAS
34  2021       MOTO          46
36  2021     PEATON          33
32  2021       AUTO          11
33  2021  BICICLETA           6
35  2021  PASAJEROS           1

Se termina cambiando el nombre de la columnas **"AÑO"** para facilitar la ligacion en POWER BI

In [314]:
df_1_ETL2_4_v1 = df_1_ETL2_4_v1.rename(columns={"AAAA": "AÑO"})

In [315]:
df_1_ETL2_4_v1.head()

     AÑO    VICTIMA  N_VICTIMAS
34  2021       MOTO          46
36  2021     PEATON          33
32  2021       AUTO          11
33  2021  BICICLETA           6
35  2021  PASAJEROS           1

-------------------------------------------------

### DF VICTIMAS

Se carga DF

In [342]:
df_1_ETL2_4_v2 = df_1_ETL2.copy()

**PASO 1:** Se agrupa el DF por la columna **"VICTIMA"** que muestra el tipo de vehiculo (o peaton) en el cual circulaba el victima, este es el conteo de los 6 años <BR> por eso no se toma en consideracion la columna **"AAAA"**

In [343]:
df_1_ETL2_4_v2 = df_1_ETL2_4_v2.groupby(['VICTIMA'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [344]:
print(len(df_1_ETL2_4_v2))
print(df_1_ETL2_4_v2.isnull().sum())
df_1_ETL2_4_v2.head(10)

10
VICTIMA       0
N_VICTIMAS    0
dtype: int64

       VICTIMA  N_VICTIMAS
0         AUTO          92
1    BICICLETA          29
2       CARGAS           7
3         MOTO         302
4        MOVIL           3
5  OBJETO FIJO           2
6    PASAJEROS           5
7       PEATON         266
8  PEATON_MOTO           2
9           SD           9

**PASO 2:** Se ordena por n de victimas.

In [345]:
df_1_ETL2_4_v2 = df_1_ETL2_4_v2.sort_values(["N_VICTIMAS"], ascending=False)

In [346]:
df_1_ETL2_4_v2.head(10)

       VICTIMA  N_VICTIMAS
3         MOTO         302
7       PEATON         266
0         AUTO          92
1    BICICLETA          29
9           SD           9
2       CARGAS           7
6    PASAJEROS           5
4        MOVIL           3
5  OBJETO FIJO           2
8  PEATON_MOTO           2

-------------------------------------------

### **SECCION 5:** Creacion de un Dataframe para las mediciones de Mes

------------------------------------------------------------

Se carga DF

In [347]:
df_1_ETL2_5_v1 = df_1_ETL2.copy()

**PASO 1:** Se agrupa el DF por la columna **"MM"** y **"AAAA"**, mes y año.

In [348]:
df_1_ETL2_5_v1 = df_1_ETL2_5_v1.groupby(['AAAA', 'MM'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [353]:
print(len(df_1_ETL2_5_v1))
print(df_1_ETL2_5_v1.isnull().sum())
df_1_ETL2_5_v1.head(10)

72
AAAA          0
MM            0
N_VICTIMAS    0
dtype: int64

    AAAA  MM  N_VICTIMAS
60  2021   1          13
64  2021   5          12
65  2021   6           9
67  2021   8           9
61  2021   2           9
71  2021  12           9
70  2021  11           8
66  2021   7           7
62  2021   3           7
63  2021   4           5

**PASO 2:** Se ordena por MES y n de victimas, y despues se toman los 5 mayores por año.

In [352]:
# Se ordenan por año y n de victimas

df_1_ETL2_5_v1 = df_1_ETL2_5_v1.sort_values(["AAAA","N_VICTIMAS"], ascending=False)

In [354]:
# Se toman los 5 primeros de cada año

df_1_ETL2_5_v1 = df_1_ETL2_5_v1.groupby('AAAA').head(5)

In [355]:
print(len(df_1_ETL2_5_v1))
print(df_1_ETL2_5_v1.isnull().sum())
df_1_ETL2_5_v1.head(10)

30
AAAA          0
MM            0
N_VICTIMAS    0
dtype: int64

    AAAA  MM  N_VICTIMAS
60  2021   1          13
64  2021   5          12
65  2021   6           9
67  2021   8           9
61  2021   2           9
59  2020  12          22
58  2020  11           9
48  2020   1           8
49  2020   2           8
57  2020  10           6

Se termina cambiando el nombre de la columnas **"AÑO"** para facilitar la ligacion en POWER BI

In [356]:
df_1_ETL2_5_v1 = df_1_ETL2_5_v1.rename(columns={"AAAA": "AÑO"})

In [357]:
df_1_ETL2_5_v1.head()

     AÑO  MM  N_VICTIMAS
60  2021   1          13
64  2021   5          12
65  2021   6           9
67  2021   8           9
61  2021   2           9

-------------------------------------

### DF MES

Se carga DF

In [360]:
df_1_ETL2_5_v2 = df_1_ETL2.copy()

**PASO 1:** Se agrupa el DF por la columna **"MM"** que muestra mes cao mas victimas, este es el conteo de los 6 años  por eso no se toma en consideracion la columna **"AAAA"**

In [361]:
df_1_ETL2_5_v2 = df_1_ETL2_5_v2.groupby(['MM'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [362]:
print(len(df_1_ETL2_5_v2))
print(df_1_ETL2_5_v2.isnull().sum())
df_1_ETL2_5_v2.head(10)

12
MM            0
N_VICTIMAS    0
dtype: int64

   MM  N_VICTIMAS
0   1          62
1   2          59
2   3          56
3   4          52
4   5          60
5   6          58
6   7          51
7   8          67
8   9          51
9  10          52

**PASO 2:** Se ordena por n de victimas.

In [363]:
df_1_ETL2_5_v2 = df_1_ETL2_5_v2.sort_values(["N_VICTIMAS"], ascending=False)

In [365]:
df_1_ETL2_5_v2.head(12)

    MM  N_VICTIMAS
11  12          81
10  11          68
7    8          67
0    1          62
4    5          60
1    2          59
5    6          58
2    3          56
3    4          52
9   10          52
6    7          51
8    9          51

--------------------------------

### **SECCION 6:** Creacion de un Dataframe para las mediciones de Dia

-----------------------------------------------

Se carga DF

In [369]:
df_1_ETL2_6_v1 = df_1_ETL2.copy()

**PASO 1:** Se filtra por año y dia el DF, y n de victimas

In [370]:
df_1_ETL2_6_v1 = df_1_ETL2_6_v1.groupby(['AAAA', 'DD'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [371]:
print(len(df_1_ETL2_6_v1))
print(df_1_ETL2_6_v1.isnull().sum())
df_1_ETL2_6_v1.head(10)

180
AAAA          0
DD            0
N_VICTIMAS    0
dtype: int64

   AAAA  DD  N_VICTIMAS
0  2016   1           1
1  2016   2           5
2  2016   3           5
3  2016   4           6
4  2016   5           1
5  2016   6           3
6  2016   7           4
7  2016   8           3
8  2016   9           2
9  2016  10           5

**PASO 2:** Se ordena por MES, DIA y n de victimas, y despues se toman los 5 mayores por año.

In [372]:
# Se ordenan por año y n de victimas

df_1_ETL2_6_v1 = df_1_ETL2_6_v1.sort_values(["AAAA","N_VICTIMAS"], ascending=False)

In [373]:
# Se toman los 5 primeros de cada año

df_1_ETL2_6_v1 = df_1_ETL2_6_v1.groupby('AAAA').head(5)

**RESULTADO**

In [374]:
print(len(df_1_ETL2_6_v1))
print(df_1_ETL2_6_v1.isnull().sum())
df_1_ETL2_6_v1.head(10)

30
AAAA          0
DD            0
N_VICTIMAS    0
dtype: int64

     AAAA  DD  N_VICTIMAS
168  2021  20           9
152  2021   2           6
159  2021  11           6
153  2021   3           5
154  2021   6           5
128  2020   5           7
141  2020  19           6
150  2020  30           6
147  2020  27           5
127  2020   4           4

Se termina cambiando el nombre de la columnas **"AÑO"** para facilitar la ligacion en POWER BI

In [375]:
df_1_ETL2_6_v1 = df_1_ETL2_6_v1.rename(columns={"AAAA": "AÑO"})

In [376]:
df_1_ETL2_6_v1.head()

      AÑO  DD  N_VICTIMAS
168  2021  20           9
152  2021   2           6
159  2021  11           6
153  2021   3           5
154  2021   6           5

----------------------------------------

### DF DIAS

Se carga DF

In [377]:
df_1_ETL2_6_v2 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por dia y n de victimas, sin año ya que es el total de los 6 años

In [378]:
df_1_ETL2_6_v2 = df_1_ETL2_6_v2.groupby(['DD'])['N_VICTIMAS'].sum().reset_index()

In [379]:
print(len(df_1_ETL2_6_v2))
print(df_1_ETL2_6_v2.isnull().sum())
df_1_ETL2_6_v2.head(10)

31
DD            0
N_VICTIMAS    0
dtype: int64

   DD  N_VICTIMAS
0   1          18
1   2          24
2   3          28
3   4          23
4   5          19
5   6          20
6   7          23
7   8          14
8   9          27
9  10          26

**PASO 2:** Se ordena por n de victimas.

In [380]:
df_1_ETL2_6_v2 = df_1_ETL2_6_v2.sort_values(["N_VICTIMAS"], ascending=False)

In [381]:
df_1_ETL2_6_v2.head(10)

    DD  N_VICTIMAS
19  20          32
16  17          30
10  11          28
2    3          28
13  14          27
26  27          27
8    9          27
24  25          26
27  28          26
11  12          26

------------------------------------

### **SECCION 7:** Creacion de un Dataframe para las mediciones de Calle

-----------------------------------

Se carga DF

In [382]:
df_1_ETL2_7_v1 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por año y calle, sumando el n de victimas

In [383]:
df_1_ETL2_7_v1 = df_1_ETL2_7_v1.groupby(['AAAA', 'Calle'])['N_VICTIMAS'].sum().reset_index()

In [384]:
print(len(df_1_ETL2_7_v1))
print(df_1_ETL2_7_v1.isnull().sum())
df_1_ETL2_7_v1.head()

484
AAAA          0
Calle         0
N_VICTIMAS    0
dtype: int64

   AAAA                       Calle  N_VICTIMAS
0  2016           27 DE FEBRERO AV.           4
1  2016              9 DE JULIO AV.           1
2  2016             ACOSTA, MARIANO           2
3  2016  ALBERDI, JUAN BAUTISTA AV.           4
4  2016        ALCORTA, AMANCIO AV.           3

**PASO 2:** Se ordena por año, calle y n de victimas, y despues se toman los 5 mayores por año.

In [385]:
# Se ordenan por año y n de victimas

df_1_ETL2_7_v1 = df_1_ETL2_7_v1.sort_values(["AAAA","N_VICTIMAS"], ascending=False)

In [386]:
# Se toman los 5 primeros de cada año

df_1_ETL2_7_v1 = df_1_ETL2_7_v1.groupby('AAAA').head(5)

**RESULTADO**

In [387]:
print(len(df_1_ETL2_7_v1))
print(df_1_ETL2_7_v1.isnull().sum())
df_1_ETL2_7_v1.head(10)

30
AAAA          0
Calle         0
N_VICTIMAS    0
dtype: int64

     AAAA                                       Calle  N_VICTIMAS
466  2021                              PAZ, GRAL. AV.          10
428  2021  AUTOPISTA 1 SUR PRESIDENTE ARTURO FRONDIZI           5
445  2021                          DEL LIBERTADOR AV.           4
467  2021                              PERON, EVA AV.           4
429  2021                        AUTOPISTA 25 DE MAYO           3
409  2020                              PAZ, GRAL. AV.           6
415  2020                              SAN MARTIN AV.           3
362  2020                        ALEM, LEANDRO N. AV.           2
385  2020                              CORRIENTES AV.           2
387  2020                          DEL LIBERTADOR AV.           2

Se termina cambiando el nombre de la columnas **"AÑO"** para facilitar la ligacion en POWER BI

In [388]:
df_1_ETL2_7_v1 = df_1_ETL2_7_v1.rename(columns={"AAAA": "AÑO"})

In [389]:
df_1_ETL2_7_v1.head()

      AÑO                                       Calle  N_VICTIMAS
466  2021                              PAZ, GRAL. AV.          10
428  2021  AUTOPISTA 1 SUR PRESIDENTE ARTURO FRONDIZI           5
445  2021                          DEL LIBERTADOR AV.           4
467  2021                              PERON, EVA AV.           4
429  2021                        AUTOPISTA 25 DE MAYO           3

-----------------------

### DF DIAS

Se cargan DF

In [390]:
df_1_ETL2_7_v2 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por calle, sumando el n de victimas, sin año ya que es el total de los 6 años

In [391]:
df_1_ETL2_7_v2 = df_1_ETL2_7_v2.groupby(['Calle'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [392]:
print(len(df_1_ETL2_7_v2))
print(df_1_ETL2_7_v2.isnull().sum())
df_1_ETL2_7_v2.head(10)

280
Calle         0
N_VICTIMAS    0
dtype: int64

                            Calle  N_VICTIMAS
0        11 DE SEPTIEMBRE DE 1888           1
1         15 DE NOVIEMBRE DE 1889           2
2                 24 DE NOVIEMBRE           3
3               27 DE FEBRERO AV.           8
4                  9 DE JULIO AV.           5
5  ACHAVAL RODRIGUEZ, T., DR. AV.           3
6                 ACOSTA, MARIANO           2
7             ACOSTA, MARIANO AV.           1
8                          AGRELO           1
9                        ALBARI?O           1

**PASO 2:** Se ordena por n de victimas.

In [393]:
df_1_ETL2_7_v2 = df_1_ETL2_7_v2.sort_values(["N_VICTIMAS"], ascending=False)

In [394]:
df_1_ETL2_7_v2.head()

                                          Calle  N_VICTIMAS
212                              PAZ, GRAL. AV.          61
235                               RIVADAVIA AV.          20
108                          DEL LIBERTADOR AV.          19
31   AUTOPISTA 1 SUR PRESIDENTE ARTURO FRONDIZI          14
36                      AUTOPISTA PERITO MORENO          13

--------------------------

### **SECCION 8:** Creacion de un Dataframe para las mediciones de COMUNA

---------------------------------------------------------

Se carga DF

In [398]:
df_1_ETL2_8_v1 = df_1_ETL2.copy()

**PASO 1:** Se agrupa en años, comuna por numero de victimas

In [399]:
df_1_ETL2_8_v1 = df_1_ETL2_8_v1.groupby(['COMUNA'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [400]:
print(len(df_1_ETL2_8_v1))
print(df_1_ETL2_8_v1.isnull().sum())
df_1_ETL2_8_v1.head(10)

16
COMUNA        0
N_VICTIMAS    0
dtype: int64

   COMUNA  N_VICTIMAS
0       0           2
1       1          93
2       2          25
3       3          46
4       4          79
5       5          22
6       6          22
7       7          62
8       8          67
9       9          75

**PASO 2:** Se ordena por n de victimas.

In [401]:
df_1_ETL2_8_v1 = df_1_ETL2_8_v1.sort_values(["N_VICTIMAS"], ascending=False)

In [402]:
df_1_ETL2_8_v1.head()

   COMUNA  N_VICTIMAS
1       1          93
4       4          79
9       9          75
8       8          67
7       7          62

--------------------------------------

### **SECCION 9:** Creacion de un Dataframe para las mediciones de ACUSADO

--------------------------

Se carga DF

In [403]:
df_1_ETL2_9_v1 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por año, acusado y n de victimas, acusado muestra el vehiculo en el cual el acusado cometio el delito.

In [404]:
df_1_ETL2_9_v1 = df_1_ETL2_9_v1.groupby(['AAAA', 'ACUSADO'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [405]:
print(len(df_1_ETL2_9_v1))
print(df_1_ETL2_9_v1.isnull().sum())
df_1_ETL2_9_v1.head(10)

50
AAAA          0
ACUSADO       0
N_VICTIMAS    0
dtype: int64

   AAAA      ACUSADO  N_VICTIMAS
0  2016         AUTO          39
1  2016    BICICLETA           1
2  2016       CARGAS          25
3  2016         MOTO          14
4  2016     MULTIPLE           2
5  2016  OBJETO FIJO           9
6  2016         OTRO           1
7  2016    PASAJEROS          42
8  2016           SD          13
9  2017         AUTO          40

**PASO 2:** Se ordena por año y n de victimas, y despues se toman los 5 mayores por año.

In [406]:
# Se ordenan por año y n de victimas

df_1_ETL2_9_v1 = df_1_ETL2_9_v1.sort_values(["AAAA","N_VICTIMAS"], ascending=False)

In [407]:
# Se toman los 5 primeros de cada año

df_1_ETL2_9_v1 = df_1_ETL2_9_v1.groupby('AAAA').head(5)

**RESULTADO**

In [408]:
print(len(df_1_ETL2_9_v1))
print(df_1_ETL2_9_v1.isnull().sum())
df_1_ETL2_9_v1.head(10)

30
AAAA          0
ACUSADO       0
N_VICTIMAS    0
dtype: int64

    AAAA      ACUSADO  N_VICTIMAS
41  2021         AUTO          31
43  2021       CARGAS          23
46  2021  OBJETO FIJO          20
48  2021    PASAJEROS          14
44  2021         MOTO           3
35  2020         AUTO          27
40  2020    PASAJEROS          19
36  2020       CARGAS          14
37  2020         MOTO          10
39  2020  OBJETO FIJO          10

Se termina cambiando el nombre de la columnas **"AÑO"** para facilitar la ligacion en POWER BI

In [409]:
df_1_ETL2_9_v1 = df_1_ETL2_9_v1.rename(columns={"AAAA": "AÑO"})

In [410]:
df_1_ETL2_9_v1.head()

     AÑO      ACUSADO  N_VICTIMAS
41  2021         AUTO          31
43  2021       CARGAS          23
46  2021  OBJETO FIJO          20
48  2021    PASAJEROS          14
44  2021         MOTO           3

------------------------------------------

### DF ACUSADO

Se carga DF

In [416]:
df_1_ETL2_9_v2 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por acusado y n de victimas, ya que es la sumatoria de los 6 años de registro.

In [417]:
df_1_ETL2_9_v2 = df_1_ETL2_9_v2.groupby(['ACUSADO'])['N_VICTIMAS'].sum().reset_index()

In [418]:
print(len(df_1_ETL2_9_v2))
print(df_1_ETL2_9_v2.isnull().sum())
df_1_ETL2_9_v2.head(10)

10
ACUSADO       0
N_VICTIMAS    0
dtype: int64

       ACUSADO  N_VICTIMAS
0         AUTO         210
1    BICICLETA           7
2       CARGAS         150
3         MOTO          58
4     MULTIPLE          17
5  OBJETO FIJO          67
6         OTRO           6
7    PASAJEROS         178
8           SD          23
9         TREN           1

**PASO 2:** Se ordena por n de victimas.

In [419]:
df_1_ETL2_9_v2 = df_1_ETL2_9_v2.sort_values(["N_VICTIMAS"], ascending=False)

In [420]:
df_1_ETL2_9_v2.head()

       ACUSADO  N_VICTIMAS
0         AUTO         210
7    PASAJEROS         178
2       CARGAS         150
5  OBJETO FIJO          67
3         MOTO          58

-----------------------------------

### **SECCION 10:** Creacion de un Dataframe para las mediciones de HORA

------------------------------

Se carga DF

In [429]:
df_1_ETL2_10_v1 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por año, hora y n de victimas.

In [430]:
df_1_ETL2_10_v1 = df_1_ETL2_10_v1.groupby(['AAAA', 'HH'])['N_VICTIMAS'].sum().reset_index()

**RESULTADO**

In [431]:
print(len(df_1_ETL2_10_v1))
print(df_1_ETL2_10_v1.isnull().sum())
df_1_ETL2_10_v1.head(10)

143
AAAA          0
HH            0
N_VICTIMAS    0
dtype: int64

   AAAA  HH  N_VICTIMAS
0  2016   0           9
1  2016   1           4
2  2016  10           4
3  2016  11           8
4  2016  12           5
5  2016  14           3
6  2016  15           7
7  2016  16          10
8  2016  17           5
9  2016  18           6

**PASO 2:** Se ordena por año y n de victimas, y despues se toman los 5 mayores por año.

In [432]:
# Se ordenan por año y n de victimas

df_1_ETL2_10_v1 = df_1_ETL2_10_v1.sort_values(["AAAA","N_VICTIMAS"], ascending=False)

In [433]:
# Se toman los 5 primeros de cada año

df_1_ETL2_10_v1 = df_1_ETL2_10_v1.groupby('AAAA').head(5)

**RESULTADO**

In [434]:
print(len(df_1_ETL2_10_v1))
print(df_1_ETL2_10_v1.isnull().sum())
df_1_ETL2_10_v1.head(10)

30
AAAA          0
HH            0
N_VICTIMAS    0
dtype: int64

     AAAA  HH  N_VICTIMAS
139  2021   6           7
124  2021  12           6
138  2021   5           6
142  2021   9           6
121  2021   1           5
116  2020   6           9
102  2020  14           7
117  2020   7           6
109  2020  20           5
110  2020  21           5

Se termina cambiando el nombre de la columnas **"AÑO"** para facilitar la ligacion en POWER BI

In [435]:
df_1_ETL2_10_v1 = df_1_ETL2_10_v1.rename(columns={"AAAA": "AÑO"})

In [436]:
df_1_ETL2_10_v1.head()

      AÑO  HH  N_VICTIMAS
139  2021   6           7
124  2021  12           6
138  2021   5           6
142  2021   9           6
121  2021   1           5

-----------------------------------

### DF HORA

Se carga DF

In [437]:
df_1_ETL2_10_v2 = df_1_ETL2.copy()

**PASO 1:** Se agrupa por hora y n de victimas, ya que se va a tomar los 6 años.

In [438]:
df_1_ETL2_10_v2 = df_1_ETL2_10_v2.groupby(['HH'])['N_VICTIMAS'].sum().reset_index()

In [439]:
print(len(df_1_ETL2_10_v2))
print(df_1_ETL2_10_v2.isnull().sum())
df_1_ETL2_10_v2.head(10)

25
HH            0
N_VICTIMAS    0
dtype: int64

   HH  N_VICTIMAS
0   0          23
1   1          25
2  10          31
3  11          29
4  12          32
5  13          17
6  14          33
7  15          25
8  16          30
9  17          31

**PASO 2:** Se ordena por n de victimas.

In [440]:
df_1_ETL2_10_v2 = df_1_ETL2_10_v2.sort_values(["N_VICTIMAS"], ascending=False)

In [441]:
df_1_ETL2_10_v2.head()

    HH  N_VICTIMAS
21   7          43
20   6          42
19   5          39
23   9          37
6   14          33

-------------------------------------------------------------------------------

### **SECCION FINAL:** Se carga todos los dataframes a un archivo excel, cada DF es una pestaña del excel

-------------------------------

In [442]:
with pd.ExcelWriter('Archivos\data_KPI.xlsx') as writer:
    
    df_1_ETL2_v6.to_excel(writer, sheet_name='KPI_1', index=False)
    df_1_ETL2_2_v6.to_excel(writer, sheet_name='KPI_1_x_COMUNA', index=False)
    df_1_ETL2_3_v5.to_excel(writer, sheet_name='KPI_2', index=False)
    df_1_ETL2_4_v1.to_excel(writer, sheet_name='VICTIMASxANIO', index=False)
    df_1_ETL2_4_v2.to_excel(writer, sheet_name='VICTIMAS', index=False)
    df_1_ETL2_5_v1.to_excel(writer, sheet_name='MESxANIO', index=False)
    df_1_ETL2_5_v2.to_excel(writer, sheet_name='MES', index=False)
    df_1_ETL2_6_v1.to_excel(writer, sheet_name='DIASxANIO', index=False)
    df_1_ETL2_6_v2.to_excel(writer, sheet_name='DIAS', index=False)
    df_1_ETL2_7_v1.to_excel(writer, sheet_name='CALLExANIO', index=False)
    df_1_ETL2_7_v2.to_excel(writer, sheet_name='CALLE', index=False)
    df_1_ETL2_8_v1.to_excel(writer, sheet_name='COMUNA', index=False)
    df_1_ETL2_9_v1.to_excel(writer, sheet_name='ACUSADOxANIO', index=False)
    df_1_ETL2_9_v2.to_excel(writer, sheet_name='ACUSADO', index=False)
    df_1_ETL2_10_v1.to_excel(writer, sheet_name='HORAxANIO', index=False)
    df_1_ETL2_10_v2.to_excel(writer, sheet_name='HORA', index=False)